{
  "project": "Slurpee Event Broker",
  "branchName": "ralph/unit-tests",
  "description": "Add unit tests for core functionality: /api/events and /api/subscribers endpoints, and the event dispatch/delivery pipeline. Tests focus on behavior over implementation, using mocked database dependencies and httptest servers.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Enable sqlc Querier interface and refactor Application",
      "description": "As a developer, I need a mockable interface for database operations so that handlers and business logic can be tested without a real database.",
      "acceptanceCriteria": [
        "Add `emit_interface: true` to `sqlc.yaml` under `gen.go`",
        "Regenerate sqlc code (`go tool sqlc generate`) — the `Querier` interface in `db/querier.go` is now populated with all query methods",
        "Change `Application.DB` field type from `*db.Queries` to `db.Querier`",
        "Update `NewApp()` and any code that assigns to `Application.DB` to work with the interface",
        "All existing code compiles without errors (`go build ./...`)"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Set up test infrastructure",
      "description": "As a developer, I need test dependencies, mock implementations, and helper functions so that writing tests is straightforward and consistent.",
      "acceptanceCriteria": [
        "Add `github.com/stretchr/testify` as a test dependency",
        "Create `testutil/mock_querier.go` with a testify mock implementation of `db.Querier`",
        "Create `testutil/factories.go` with factory functions that build test instances of `db.Event`, `db.Subscriber`, `db.Subscription`, `db.ApiSecret`, and `app.Application` (with mock DB, config, channels, etc.)",
        "Factory functions use sensible defaults but allow overrides",
        "Create `testutil/helpers.go` with HTTP test helpers: functions to build `*http.Request` with headers (secret ID, secret value, admin secret, JSON body) and to assert JSON response bodies",
        "All test utilities compile (`go test ./testutil/...`)",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Unit tests for pure business logic",
      "description": "As a developer, I want tests for the pure functions that don't require database mocks, so that core logic is verified in isolation.",
      "acceptanceCriteria": [
        "Tests for `app.CheckSendScope` — verifies SQL LIKE-style pattern matching: exact match, `%` wildcard, `_` single-char wildcard, no match, edge cases (empty pattern, empty subject)",
        "Tests for `app.MatchLikePattern` — covers `%` at start/end/middle, `_` matching, escaped characters, multiple wildcards",
        "Tests for `matchesFilter` in `app/delivery.go` — matching filter, non-matching filter, empty/nil filter matches all, partial key match, nested JSON values",
        "Tests for `calculateBackoff` in `app/delivery.go` — verifies exponential growth, respects max backoff cap, first attempt backoff",
        "All tests pass (`go test ./app/...`)",
        "Tests are table-driven where appropriate"
      ],
      "priority": 3,
      "passes": true,
      "notes": "matchesFilter and calculateBackoff are unexported — test from within app package (package app, not app_test)"
    },
    {
      "id": "US-004",
      "title": "Unit tests for POST /api/events",
      "description": "As a developer, I want tests that verify the behavior of creating events through the API, covering authentication, authorization, validation, and the happy path.",
      "acceptanceCriteria": [
        "Test: request without secret headers returns 401",
        "Test: request with invalid secret ID (not a UUID) returns 400",
        "Test: request with valid secret ID but wrong secret value returns 401",
        "Test: request with valid credentials but subject outside secret's scope returns 403",
        "Test: request with missing required fields (subject, data) returns 400",
        "Test: request with invalid JSON body returns 400",
        "Test: successful event creation returns 201 with event ID, subject, timestamp, and data in response",
        "Test: successful event creation sends event to delivery channel",
        "Tests use mock Querier, `httptest.NewRecorder`, and `httptest.NewRequest`",
        "All tests pass (`go test ./api/...`)"
      ],
      "priority": 4,
      "passes": true,
      "notes": "API handlers take (slurpee *app.Application, w, r). Construct Application with mock DB. ValidateSecretByID is called on the Querier. DeliveryChan is a buffered channel on Application — read from it to verify event dispatch."
    },
    {
      "id": "US-005",
      "title": "Unit tests for GET /api/events/{id}",
      "description": "As a developer, I want tests that verify the behavior of retrieving events by ID through the API.",
      "acceptanceCriteria": [
        "Test: request without secret headers returns 401",
        "Test: request with valid credentials for nonexistent event returns 404",
        "Test: request with valid credentials for existing event returns 200 with correct event data",
        "Test: response JSON structure matches the documented `EventResponse` format",
        "Tests use mock Querier",
        "All tests pass (`go test ./api/...`)"
      ],
      "priority": 5,
      "passes": false,
      "notes": "GET endpoint validates secret but does not check scope (read-only, any valid secret works)."
    },
    {
      "id": "US-006",
      "title": "Unit tests for /api/subscribers endpoints",
      "description": "As a developer, I want tests that verify the behavior of subscriber management API endpoints: creating/updating subscribers and listing them.",
      "acceptanceCriteria": [
        "Test POST: request without admin secret returns 401",
        "Test POST: request with wrong admin secret returns 401",
        "Test POST: request with missing required fields (name, endpoint_url) returns 400",
        "Test POST: request with invalid endpoint URL returns 400",
        "Test POST: successful subscriber creation returns 201 with subscriber details and subscriptions",
        "Test POST: subscriber creation with subscriptions creates both subscriber and subscription records",
        "Test GET: request without admin secret returns 401",
        "Test GET: successful request returns 200 with list of subscribers and their subscriptions",
        "Test GET: empty subscriber list returns 200 with empty array",
        "Tests use mock Querier",
        "All tests pass (`go test ./api/...`)"
      ],
      "priority": 6,
      "passes": false,
      "notes": "Subscriber endpoints use X-Slurpee-Admin-Secret header, validated against config.AdminSecret (simple string comparison)."
    },
    {
      "id": "US-007",
      "title": "Unit tests for event dispatch and delivery",
      "description": "As a developer, I want tests that verify the full delivery pipeline: matching events to subscribers, building and sending webhook requests, handling responses, and retry behavior.",
      "acceptanceCriteria": [
        "Test: `deliverToSubscriber` sends POST to subscriber endpoint with correct headers (`Content-Type`, `X-Slurpee-Secret`, `X-Event-ID`, `X-Event-Subject`) and body (event data)",
        "Test: `deliverToSubscriber` returns true for 2xx responses and false for non-2xx",
        "Test: `deliverToSubscriber` records delivery attempt in database with request/response details",
        "Test: `dispatchEvent` finds matching subscriptions and enqueues delivery tasks",
        "Test: `dispatchEvent` skips subscriptions whose filters don't match the event data",
        "Test: delivery retries on failure up to the configured max retries",
        "Test: event status is updated to 'delivered' when all deliveries succeed",
        "Test: event status is updated to 'failed' when all deliveries fail after retries",
        "Tests use `httptest.Server` for webhook endpoints and mock Querier for database",
        "All tests pass (`go test ./app/...`)"
      ],
      "priority": 7,
      "passes": false,
      "notes": "deliverToSubscriber and dispatchEvent are unexported — test from within app package. Use httptest.Server as the webhook endpoint. The delivery pipeline uses goroutines and channels — tests may need short timeouts or synchronization helpers."
    }
  ]
}
