{
  "project": "Slurpee Event Broker",
  "branchName": "ralph/e2e-tests",
  "description": "End-to-end regression tests using embedded-postgres that exercise the full API stack against a real PostgreSQL database. Validates the complete request-to-database-to-response cycle, delivery pipeline, deduplication, retries, and pattern matching — catching issues that mock-based unit tests cannot.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Set up embedded-postgres test infrastructure",
      "description": "As a developer, I need reusable test infrastructure that starts an embedded PostgreSQL instance, runs migrations, and provides helpers for creating test fixtures against the real database, so that all E2E tests can share this foundation.",
      "acceptanceCriteria": [
        "Add `github.com/fergusstrange/embedded-postgres` dependency",
        "Create `tests/e2e/` package with `TestMain` that starts embedded-postgres once for the package",
        "TestMain checks `testing.Short()` and skips all E2E tests when `-short` flag is passed",
        "TestMain runs all `schema/*.sql` migration files (sorted by filename) against the embedded database on startup, parsing only the `-- +migrate Up` section",
        "Provide a `truncateAll(t *testing.T)` helper that truncates all tables between tests (respecting FK order: delivery_attempts, api_secret_subscribers, subscriptions, subscribers, api_secrets, events, log_config)",
        "Provide a `newTestApp(t *testing.T)` helper that returns an `*app.Application` wired to the real database (real `db.Queries`, not mock) with sensible config defaults (AdminSecret, MaxRetries=2, MaxBackoffSeconds=1, DeliveryWorkers=2, DeliveryQueueSize=100, DeliveryChanSize=100)",
        "Provide a `newTestRouter(t *testing.T, slurpee *app.Application)` helper that returns an `*http.ServeMux` with API routes registered via `api.AddApis`",
        "Provide seed helpers: `seedSubscriber`, `seedSubscription`, `seedApiSecret` that insert test data directly via the real `db.Queries` interface",
        "`go build ./...` passes",
        "`go test ./tests/e2e/...` passes with a placeholder test"
      ],
      "priority": 1,
      "passes": true,
      "notes": "The db.New(conn) function returns *db.Queries satisfying db.Querier. Migration files use `-- +migrate Up` / `-- +migrate Down` format. API secret seed helpers must create secrets with real bcrypt hashes. The Application struct needs DB, Config, DeliveryChan, EventBus, and Sessions fields populated."
    },
    {
      "id": "US-002",
      "title": "E2E tests for POST /events endpoint",
      "description": "As a developer, I want E2E tests for event creation that verify the full request-to-database-to-response cycle including authentication, authorization, validation, and persistence.",
      "acceptanceCriteria": [
        "Test happy path: create event with valid API secret, verify 201 response with correct fields, verify event persisted in database via GetEventByID",
        "Test with client-provided UUID: verify the event is created with the exact ID provided",
        "Test with client-provided timestamp: verify the event stores the provided timestamp",
        "Test with optional trace_id: verify trace_id is persisted and returned",
        "Test missing X-Slurpee-Secret-ID header returns 401",
        "Test invalid/wrong API secret returns 401",
        "Test subject outside secret's scope returns 403",
        "Test missing subject returns 400",
        "Test missing data returns 400",
        "Test invalid JSON data returns 400",
        "All tests call truncateAll before running (clean state)",
        "`go test ./tests/e2e/...` passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "POST /events requires X-Slurpee-Secret-ID and X-Slurpee-Secret headers. ValidateSecretByID uses bcrypt to compare secrets. CheckSendScope validates subject against the secret's subject_pattern. Event is sent to DeliveryChan after creation — use a buffered channel and drain it in tests to avoid blocking."
    },
    {
      "id": "US-003",
      "title": "E2E tests for GET /events/{id} endpoint",
      "description": "As a developer, I want E2E tests for event retrieval that verify reading events back from the real database with proper authentication.",
      "acceptanceCriteria": [
        "Test happy path: create event via POST, then GET it by ID, verify all fields match",
        "Test event not found returns 404",
        "Test invalid UUID format returns 400",
        "Test missing API secret returns 401",
        "Test invalid API secret returns 401",
        "All tests call truncateAll before running",
        "`go test ./tests/e2e/...` passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": "GET /events/{id} validates API secret but does NOT check subject scope — any valid secret can read any event."
    },
    {
      "id": "US-004",
      "title": "E2E tests for POST /subscribers endpoint",
      "description": "As a developer, I want E2E tests for subscriber creation/upsert that verify the full cycle including subscription creation and idempotent upsert behavior against the real database.",
      "acceptanceCriteria": [
        "Test happy path: create subscriber with subscriptions, verify 200 response, verify subscriber and subscriptions persisted in database",
        "Test upsert: create subscriber, then POST again with same name/endpoint but different subscriptions, verify old subscriptions replaced",
        "Test subscription with filter: verify filter JSON persisted correctly",
        "Test subscription with max_retries override: verify persisted",
        "Test missing admin secret returns 401",
        "Test wrong admin secret returns 401",
        "Test missing required fields (name, endpoint_url, auth_secret, subscriptions) each return 400",
        "Test missing subject_pattern in subscription returns 400",
        "All tests call truncateAll before running",
        "`go test ./tests/e2e/...` passes"
      ],
      "priority": 4,
      "passes": true,
      "notes": "POST /subscribers uses X-Slurpee-Admin-Secret header (simple string comparison against config.AdminSecret). Upsert is keyed on endpoint_url (unique constraint). POST returns 200 (not 201)."
    },
    {
      "id": "US-005",
      "title": "E2E tests for GET /subscribers endpoint",
      "description": "As a developer, I want E2E tests for listing subscribers that verify the real database query returns correct data with subscriptions included.",
      "acceptanceCriteria": [
        "Test happy path: seed multiple subscribers with subscriptions via POST, verify all returned with correct subscription details",
        "Test empty list: no subscribers returns empty array []",
        "Test missing admin secret returns 401",
        "All tests call truncateAll before running",
        "`go test ./tests/e2e/...` passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": "GET /subscribers also requires X-Slurpee-Admin-Secret. Response includes nested subscriptions for each subscriber. Tests seed data via POST /api/subscribers then verify GET returns correct list with nested subscriptions."
    },
    {
      "id": "US-006",
      "title": "E2E tests for delivery pipeline",
      "description": "As a developer, I want E2E tests that verify the complete delivery pipeline: posting an event causes it to be delivered to matching subscribers' HTTP endpoints, with delivery attempts recorded in the database.",
      "acceptanceCriteria": [
        "Start an httptest.Server as a mock subscriber endpoint that records received requests",
        "Seed a subscriber pointing at the test server with a subscription matching the event subject",
        "POST an event via the API, wait for delivery to complete",
        "Verify the mock endpoint received exactly one HTTP POST with correct headers (X-Event-ID, X-Event-Subject, X-Slurpee-Secret) and the event data as the body",
        "Verify a delivery_attempts row was recorded in the database with status succeeded and correct response_status_code",
        "Verify the event's delivery_status was updated to delivered in the database",
        "Test with no matching subscriptions: event status becomes delivered (no subscribers to deliver to)",
        "All tests call truncateAll before running",
        "`go test ./tests/e2e/...` passes"
      ],
      "priority": 6,
      "passes": true,
      "notes": "Tests use httptest.NewServer as mock subscriber endpoint. app.StartDispatcher(slurpee) starts the delivery pipeline. waitForEventStatus polls the DB for delivery_status changes (no fixed sleeps). Dispatcher goroutines leak in tests but that's acceptable — each test creates its own app instance. parseUUID helper converts string UUIDs to pgtype.UUID for DB queries."
    },
    {
      "id": "US-007",
      "title": "E2E tests for subscription pattern matching and filters",
      "description": "As a developer, I want E2E tests that verify glob-style subject pattern matching and JSON filter logic work correctly with the real database query (GetSubscriptionsMatchingSubject).",
      "acceptanceCriteria": [
        "Test exact subject match: subscription with pattern order.created matches event with subject order.created",
        "Test glob wildcard: subscription with pattern order.* matches event with subject order.created",
        "Test wildcard does NOT match unrelated subjects: order.* does not match user.created",
        "Test subscription filter: subscriber with filter {\"type\": \"premium\"} only receives events where data.type == premium",
        "Test filter mismatch: event with {\"type\": \"basic\"} is NOT delivered to subscriber with filter {\"type\": \"premium\"}",
        "Verify delivery attempts are only recorded for matched subscriptions",
        "All tests call truncateAll before running",
        "`go test ./tests/e2e/...` passes"
      ],
      "priority": 7,
      "passes": true,
      "notes": "GetSubscriptionsMatchingSubject uses database-side pattern matching — this is a key thing E2E tests validate that mocks cannot. Glob wildcards use * (not %). Filter matching is AND logic on top-level JSON keys, evaluated in Go code (matchesFilter), not SQL. When all subscriptions match subject but none pass filter, dispatchEvent marks event as 'failed' (not 'delivered')."
    },
    {
      "id": "US-008",
      "title": "E2E tests for subscriber deduplication",
      "description": "As a developer, I want E2E tests that verify when a subscriber has multiple overlapping subscriptions matching the same event, only one delivery is made (the one with the highest max_retries).",
      "acceptanceCriteria": [
        "Seed a subscriber with two subscriptions: order.* (max_retries=3) and order.created (max_retries=5)",
        "POST an event with subject order.created",
        "Verify the mock endpoint received exactly ONE request (not two)",
        "Verify exactly one delivery_attempts row in the database for this event+subscriber pair",
        "Test with three overlapping patterns: verify still only one delivery",
        "All tests call truncateAll before running",
        "`go test ./tests/e2e/...` passes"
      ],
      "priority": 8,
      "passes": false,
      "notes": "Deduplication logic is in dispatchEvent — groups subscriptions by subscriber_id and picks the one with highest effective max_retries. This was recently implemented; E2E tests confirm it works with real DB data."
    },
    {
      "id": "US-009",
      "title": "E2E tests for delivery retries",
      "description": "As a developer, I want E2E tests that verify the retry mechanism works end-to-end: failed deliveries are retried up to max_retries, and delivery attempts are recorded for each attempt.",
      "acceptanceCriteria": [
        "Start a mock endpoint that returns 500 for the first N requests then 200",
        "Seed subscriber and subscription with known max_retries",
        "POST an event and wait for delivery to complete (MaxBackoffSeconds=1 for fast tests)",
        "Verify multiple delivery_attempts rows recorded (one per attempt)",
        "Verify the final event status is delivered after the successful retry",
        "Test max retries exhausted: endpoint always returns 500, verify event status becomes failed, verify exactly max_retries+1 delivery attempts recorded",
        "All tests call truncateAll before running",
        "`go test ./tests/e2e/...` passes"
      ],
      "priority": 9,
      "passes": false,
      "notes": "Use MaxBackoffSeconds=1 and MaxRetries=2 in test config to keep retry tests fast. processDeliveryTask uses time.AfterFunc for retry scheduling. Poll the database for delivery_attempts count and event status rather than using fixed sleeps."
    }
  ]
}
