{
  "project": "Slurpee Event Broker",
  "branchName": "ralph/live-event-stream",
  "description": "Add real-time live event watching to the events page using Server-Sent Events (SSE). Users toggle into live mode to stream new events, delivery status changes, and delivery attempts. Existing filters apply to the stream. Reconnection shows a missed-event indicator.",
  "userStories": [
    {
      "id": "US-001",
      "title": "SSE event bus infrastructure",
      "description": "As a developer, I need a pub/sub event bus in the Application struct so that delivery and event-creation code can broadcast updates to connected SSE clients.",
      "acceptanceCriteria": [
        "Add an EventBus struct (new file app/eventbus.go) with Subscribe (returns channel + unsubscribe func), Publish (non-blocking fan-out), and a monotonically increasing message ID",
        "Bus message struct includes: ID (uint64), Type (string: created|status_changed|delivery_attempt), EventID (string), Subject (string), DeliveryStatus (string), Timestamp (time.Time), and optional DeliveryAttempt fields (SubscriberEndpoint, AttemptStatus, ResponseStatusCode)",
        "Each subscriber gets a buffered channel (capacity 64); publish uses non-blocking send and drops messages for slow consumers",
        "Add EventBus field to Application struct and initialize it in NewApp",
        "go build ./... compiles successfully",
        "go vet ./... passes"
      ],
      "priority": 1,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Publish events to the bus from delivery pipeline",
      "description": "As a developer, I need the delivery dispatcher and event creation handler to publish messages to the EventBus so SSE clients receive real-time updates.",
      "acceptanceCriteria": [
        "eventCreateSubmitHandler in views/events.go publishes a 'created' bus message after inserting the event",
        "createEventHandler in api/events.go publishes a 'created' bus message after inserting the event",
        "updateEventStatus in api/delivery.go publishes a 'status_changed' bus message when delivery status changes",
        "deliverToSubscriber in api/delivery.go publishes a 'delivery_attempt' bus message after recording each delivery attempt (includes endpoint URL, attempt status, and response status code)",
        "go build ./... compiles successfully",
        "go vet ./... passes"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "SSE HTTP endpoint",
      "description": "As a developer, I need a GET /events/stream SSE endpoint so the browser can open a long-lived connection and receive real-time event updates.",
      "acceptanceCriteria": [
        "GET /events/stream registered in views/events.go init() function",
        "Sets response headers: Content-Type text/event-stream, Cache-Control no-cache, Connection keep-alive",
        "Subscribes to EventBus on connection, unsubscribes on client disconnect (context cancellation)",
        "Each SSE message formatted as: id:<monotonic_id>\\ndata:<json>\\n\\n",
        "Supports query parameters: subject, status, date_from, date_to, content — filters messages server-side before sending (reuse filter logic from eventsListHandler)",
        "Accepts Last-Event-ID header; if present, queries for events created after that ID's timestamp and sends a special 'missed' message with the count before resuming stream",
        "Sends keepalive comment (: keepalive) every 15 seconds",
        "Uses http.Flusher to flush after each message",
        "go build ./... compiles successfully",
        "go vet ./... passes"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Live mode toggle UI",
      "description": "As a user, I want a toggle button on the events page to switch between the normal paginated view and live streaming mode so I can watch events in real-time.",
      "acceptanceCriteria": [
        "Go Live button appears next to the New Event button on the events page header",
        "Clicking Go Live switches the events table to live mode: clears existing rows and opens an EventSource connection to /events/stream",
        "Button changes to Stop with a pulsing green dot indicator while live mode is active",
        "Clicking Stop closes the EventSource connection and reloads the normal paginated events list via HTMX GET /events",
        "New events from the SSE stream prepend to the top of the table as new rows (same format as normal table rows: subject, truncated ID, timestamp, status badge)",
        "Each row is clickable and navigates to /events/{id} (same as normal mode)",
        "Live mode caps the visible table at 100 rows, removing the oldest rows when exceeded",
        "Pagination controls are hidden during live mode",
        "go build ./... compiles successfully",
        "go vet ./... passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 4,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Live filtering with existing filter bar",
      "description": "As a user, I want the filter bar to apply to the live stream so I can watch only the events I care about.",
      "acceptanceCriteria": [
        "When live mode is active, clicking Search in the filter bar closes the current EventSource connection and opens a new one with the filter values as query parameters",
        "Clicking Clear resets filters and reconnects EventSource without filter query parameters",
        "Server-side filtering in the SSE endpoint works for: subject (case-insensitive contains), status (exact match), content (JSON key-value containment on the event data)",
        "go build ./... compiles successfully",
        "go vet ./... passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 5,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-006",
      "title": "Delivery status updates in live stream",
      "description": "As a user, I want to see delivery status changes and delivery attempts in the live stream so I can monitor the full event lifecycle.",
      "acceptanceCriteria": [
        "When a status_changed message arrives for an event already in the live table, its status badge updates in-place (no new row added)",
        "When a delivery_attempt message arrives, a brief toast notification appears at the bottom-right showing the subscriber endpoint and attempt result (e.g. 'Delivered to https://example.com' or 'Failed delivery to https://example.com - 500')",
        "Toast notifications auto-dismiss after 3 seconds",
        "Status badge colors match existing convention: badge-success for delivered, badge-error for failed, badge-warning for pending, badge-info for partial",
        "go build ./... compiles successfully",
        "go vet ./... passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 6,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-007",
      "title": "Reconnection with missed event indicator",
      "description": "As a user, when my connection drops and reconnects I want to know how many events I missed and have the option to load them.",
      "acceptanceCriteria": [
        "EventSource automatically reconnects on disconnect (browser built-in behavior) and sends Last-Event-ID header",
        "SSE endpoint receives Last-Event-ID, counts events created after that point (respecting active filters), and sends a 'missed' SSE event with the count",
        "Client-side JavaScript displays a banner at the top of the live table: 'You missed X events while away' with a 'Load' button",
        "Clicking Load fetches the missed events via a regular HTMX GET request and prepends them to the live table",
        "If no events were missed, streaming resumes silently with no banner",
        "Banner is dismissible (X close button) without loading missed events",
        "go build ./... compiles successfully",
        "go vet ./... passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 7,
      "passes": false,
      "notes": ""
    }
  ]
}
